{
  "backend/main.mo": "Motoko canister implementing user profiles, role-based access control, and full menu/order management (categories, items, orders) with admin-only mutations and customer order lifecycle handling.",
  "feature_evidence.json": "Structured report mapping implemented product features to frontend files, components, and test requirements with confidence levels for traceability.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend source files, describing routing, state management, UI components, pages, and utilities.",
  "frontend/index.css": "Global Tailwind CSS configuration defining design tokens, color themes, light/dark modes, and base styles for the application.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React application and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router routes, global layout, theme provider, cart provider, and profile setup modal logic.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication and authorization guard that enforces login and optional admin access, showing appropriate sign-in or access-denied UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication with loading states and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first-time authenticated users to enter and save their display name to their backend user profile.",
  "frontend/src/components/brand/BrandHeader.tsx": "Renders a sticky top header with the brand logo, greets the authenticated user by name if available, and shows a login button using Internet Identity state.",
  "frontend/src/components/menu/CategoryNav.tsx": "Displays a sticky horizontal tab navigation for menu categories, allowing selection of a specific category or all categories.",
  "frontend/src/components/menu/ItemCard.tsx": "Shows a clickable menu item card with image, description, price, availability state, and an add-to-cart button that updates cart context and navigates to item details.",
  "frontend/src/components/navigation/BottomNav.tsx": "Implements a fixed bottom navigation bar with menu, cart (with item count badge), and an admin link when the caller is an admin.",
  "frontend/src/context/CartContext.tsx": "Provides cart state management via React context and reducer, supporting add/remove/update items, persistence in sessionStorage, and total/count helpers.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines an Internet Identity authentication context and provider, handling login, logout, identity persistence, and login status using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating backend data such as user profiles, admin status, categories, items, orders, and order updates via the actor.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and a warm light/dark color theme using CSS variables, plus global utility and body styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app and wraps it with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminMenuPage.tsx": "Admin interface for managing categories and menu items with create, update, and delete functionality. Uses dialogs, tabs, and forms to edit item details, pricing, availability, and categories under authentication.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin dashboard page that lists all orders, displays order details and items, shows status badges, and allows admins to update order status using valid state transitions with feedback via toasts.",
  "frontend/src/pages/CartPage.tsx": "Displays the authenticated user's shopping cart, allowing quantity adjustments, item removal, and viewing the total price. Handles empty-cart state with a prompt to browse the menu.",
  "frontend/src/pages/CheckoutPage.tsx": "Shows an order summary from the cart and lets authenticated users place an order via a mutation, handling loading, success, and error states. Redirects to order confirmation on success or menu if the cart is empty.",
  "frontend/src/pages/ItemDetailPage.tsx": "Displays detailed information for a single menu item, including availability, price, description, and quantity selection. Allows adding the item to the cart and redirects to the cart after adding.",
  "frontend/src/pages/MenuPage.tsx": "Main menu page that requires authentication, loads categories and items, and supports category filtering. Displays available items in a grid and handles login and loading states.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows confirmation details for a placed order, including items and total price, based on the order ID route param. Handles missing orders and provides navigation back to the menu.",
  "frontend/src/utils/menuPlaceholders.ts": "Utility functions to format prices from cents to USD currency strings and provide a placeholder image URL for menu items.",
  "frontend/src/utils/orderStatus.ts": "Defines valid order status transitions by returning the allowed next statuses for a given current order status.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (including hash-based routing), persisting them in sessionStorage, retrieving/clearing them, and managing sensitive params without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens via CSS variables, layout defaults, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the app’s purpose and tracking implemented features, versions, and requirements for customer ordering and admin management functionality."
}